combined/BEEGFS-all-master-node/fio-barenode-read-unbuffered-block_512k-size_1G-threads_4.log
fio-beegfs-read-unbuffered-block_512k-size_1G-threads_4: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 4 processes
fio-beegfs-read-unbuffered-block_512k-size_1G-threads_4: Laying out IO file(s) (4 file(s) / 4096MB)
fio-beegfs-read-unbuffered-block_512k-size_1G-threads_4: Laying out IO file(s) (4 file(s) / 4096MB)
fio-beegfs-read-unbuffered-block_512k-size_1G-threads_4: Laying out IO file(s) (4 file(s) / 4096MB)
[...]

fio-beegfs-read-unbuffered-block_512k-size_1G-threads_4: (groupid=0, jobs=4): err= 0: pid=3553947: Wed Nov 21 16:01:34 2018
  read : io=115013MB, bw=490700KB/s, iops=958, runt=240010msec
    clat (msec): min=2, max=213, avg= 4.17, stdev= 4.89
     lat (msec): min=2, max=213, avg= 4.17, stdev= 4.89
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    9], 99.90th=[   17], 99.95th=[  206],
     | 99.99th=[  208]
    bw (KB  /s): min=46255, max=156359, per=25.07%, avg=123013.65, stdev=14094.67
    lat (msec) : 4=55.80%, 10=43.93%, 20=0.20%, 50=0.01%, 250=0.06%
  cpu          : usr=0.08%, sys=8.22%, ctx=566851, majf=0, minf=4078
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=230025/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=115013MB, aggrb=490699KB/s, minb=490699KB/s, maxb=490699KB/s, mint=240010msec, maxt=240010msec

CPU idleness:
  system: 97.98%
  unit work: mean=55.20us, stddev=2.37