combined/BEEGFS-all-master-node/fio-barenode-read-unbuffered-block_512k-size_2G-threads_4.log
fio-beegfs-read-unbuffered-block_512k-size_2G-threads_4: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 4 processes
fio-beegfs-read-unbuffered-block_512k-size_2G-threads_4: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-read-unbuffered-block_512k-size_2G-threads_4: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-read-unbuffered-block_512k-size_2G-threads_4: Laying out IO file(s) (4 file(s) / 8192MB)
[...]

fio-beegfs-read-unbuffered-block_512k-size_2G-threads_4: (groupid=0, jobs=4): err= 0: pid=3604707: Wed Nov 21 18:55:30 2018
  read : io=115627MB, bw=493334KB/s, iops=963, runt=240003msec
    clat (usec): min=2120, max=22585, avg=4149.40, stdev=535.78
     lat (usec): min=2120, max=22585, avg=4149.55, stdev=535.78
    clat percentiles (usec):
     |  1.00th=[ 3856],  5.00th=[ 3920], 10.00th=[ 3920], 20.00th=[ 3952],
     | 30.00th=[ 3952], 40.00th=[ 3984], 50.00th=[ 4016], 60.00th=[ 4048],
     | 70.00th=[ 4256], 80.00th=[ 4256], 90.00th=[ 4320], 95.00th=[ 4384],
     | 99.00th=[ 6496], 99.50th=[ 7968], 99.90th=[10688], 99.95th=[11584],
     | 99.99th=[13248]
    bw (KB  /s): min=104031, max=126470, per=25.02%, avg=123456.13, stdev=3237.00
    lat (msec) : 4=49.32%, 10=50.51%, 20=0.17%, 50=0.01%
  cpu          : usr=0.08%, sys=8.34%, ctx=555834, majf=0, minf=4085
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=231253/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=115627MB, aggrb=493333KB/s, minb=493333KB/s, maxb=493333KB/s, mint=240003msec, maxt=240003msec

CPU idleness:
  system: 98.52%
  unit work: mean=55.51us, stddev=2.97