combined/BEEGFS-all-master-node/fio-barenode-read-unbuffered-block_64k-size_1G-threads_2.log
fio-beegfs-read-unbuffered-block_64k-size_1G-threads_2: (g=0): rw=rw, bs=64K-64K/64K-64K/64K-64K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-read-unbuffered-block_64k-size_1G-threads_2: Laying out IO file(s) (4 file(s) / 4096MB)
fio-beegfs-read-unbuffered-block_64k-size_1G-threads_2: Laying out IO file(s) (4 file(s) / 4096MB)

fio-beegfs-read-unbuffered-block_64k-size_1G-threads_2: (groupid=0, jobs=2): err= 0: pid=3418591: Wed Nov 21 08:21:34 2018
  read : io=50977MB, bw=217500KB/s, iops=3398, runt=240001msec
    clat (usec): min=394, max=13122, avg=586.81, stdev=159.70
     lat (usec): min=394, max=13122, avg=586.93, stdev=159.70
    clat percentiles (usec):
     |  1.00th=[  458],  5.00th=[  490], 10.00th=[  506], 20.00th=[  532],
     | 30.00th=[  548], 40.00th=[  564], 50.00th=[  572], 60.00th=[  588],
     | 70.00th=[  604], 80.00th=[  620], 90.00th=[  652], 95.00th=[  676],
     | 99.00th=[  772], 99.50th=[ 1240], 99.90th=[ 3184], 99.95th=[ 3312],
     | 99.99th=[ 3568]
    bw (KB  /s): min=96896, max=119040, per=50.03%, avg=108825.23, stdev=3778.61
    lat (usec) : 500=7.79%, 750=91.07%, 1000=0.47%
    lat (msec) : 2=0.31%, 4=0.37%, 10=0.01%, 20=0.01%
  cpu          : usr=0.47%, sys=10.63%, ctx=1190418, majf=0, minf=15360
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=815629/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=50977MB, aggrb=217500KB/s, minb=217500KB/s, maxb=217500KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 93.25%
  unit work: mean=52.48us, stddev=3.83