combined/BEEGFS-all-master-node/fio-barenode-write-buffered-block_1024k-size_4G-threads_8.log
fio-beegfs-write-buffered-block_1024k-size_4G-threads_8: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 8 processes
fio-beegfs-write-buffered-block_1024k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-buffered-block_1024k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-buffered-block_1024k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
[...]

fio-beegfs-write-buffered-block_1024k-size_4G-threads_8: (groupid=0, jobs=8): err= 0: pid=3832201: Sat Nov 10 13:30:47 2018
  write: io=98620MB, bw=420005KB/s, iops=410, runt=240442msec
    clat (usec): min=995, max=1056.6K, avg=19475.54, stdev=86741.15
     lat (msec): min=1, max=1056, avg=19.50, stdev=86.74
    clat percentiles (usec):
     |  1.00th=[ 1320],  5.00th=[ 1480], 10.00th=[ 1880], 20.00th=[ 2320],
     | 30.00th=[ 2448], 40.00th=[ 2544], 50.00th=[ 2576], 60.00th=[ 2640],
     | 70.00th=[ 2736], 80.00th=[ 2928], 90.00th=[ 3344], 95.00th=[ 4016],
     | 99.00th=[481280], 99.50th=[501760], 99.90th=[577536], 99.95th=[602112],
     | 99.99th=[634880]
    bw (KB  /s): min= 1610, max=421888, per=13.66%, avg=57372.92, stdev=80098.66
    lat (usec) : 1000=0.01%
    lat (msec) : 2=10.82%, 4=84.10%, 10=0.73%, 20=0.06%, 50=0.60%
    lat (msec) : 100=0.02%, 250=0.07%, 500=3.05%, 750=0.55%, 1000=0.01%
    lat (msec) : 2000=0.01%
  cpu          : usr=0.17%, sys=2.69%, ctx=2585844, majf=0, minf=2020
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=98620/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=98620MB, aggrb=420005KB/s, minb=420005KB/s, maxb=420005KB/s, mint=240442msec, maxt=240442msec

CPU idleness:
  system: 98.22%
  unit work: mean=55.23us, stddev=2.40