combined/BEEGFS-all-master-node/fio-barenode-write-buffered-block_128k-size_4G-threads_2.log
fio-beegfs-write-buffered-block_128k-size_4G-threads_2: (g=0): rw=rw, bs=128K-128K/128K-128K/128K-128K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-write-buffered-block_128k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-buffered-block_128k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)

fio-beegfs-write-buffered-block_128k-size_4G-threads_2: (groupid=0, jobs=2): err= 0: pid=3436461: Fri Nov  9 04:37:50 2018
  write: io=85126MB, bw=362648KB/s, iops=2833, runt=240367msec
    clat (usec): min=9, max=754100, avg=702.86, stdev=15543.58
     lat (usec): min=10, max=754108, avg=704.73, stdev=15543.60
    clat percentiles (usec):
     |  1.00th=[   10],  5.00th=[   10], 10.00th=[   10], 20.00th=[   11],
     | 30.00th=[   11], 40.00th=[   14], 50.00th=[   31], 60.00th=[   32],
     | 70.00th=[   33], 80.00th=[  612], 90.00th=[  684], 95.00th=[  716],
     | 99.00th=[  780], 99.50th=[  820], 99.90th=[370688], 99.95th=[473088],
     | 99.99th=[518144]
    bw (KB  /s): min=  251, max=732672, per=55.62%, avg=201696.20, stdev=268189.38
    lat (usec) : 10=0.01%, 20=40.25%, 50=33.99%, 100=0.75%, 250=0.01%
    lat (usec) : 500=0.02%, 750=22.79%, 1000=1.98%
    lat (msec) : 2=0.04%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.04%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.09%, 750=0.02%, 1000=0.01%
  cpu          : usr=0.50%, sys=11.45%, ctx=754440, majf=0, minf=14574
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=681004/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=85126MB, aggrb=362647KB/s, minb=362647KB/s, maxb=362647KB/s, mint=240367msec, maxt=240367msec

CPU idleness:
  system: 91.93%
  unit work: mean=51.60us, stddev=2.14