combined/BEEGFS-all-master-node/fio-barenode-write-buffered-block_512k-size_1G-threads_2.log
fio-beegfs-write-buffered-block_512k-size_1G-threads_2: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-write-buffered-block_512k-size_1G-threads_2: Laying out IO file(s) (4 file(s) / 4096MB)
fio-beegfs-write-buffered-block_512k-size_1G-threads_2: Laying out IO file(s) (4 file(s) / 4096MB)

fio-beegfs-write-buffered-block_512k-size_1G-threads_2: (groupid=0, jobs=2): err= 0: pid=3376103: Fri Nov  9 00:16:16 2018
  write: io=237412MB, bw=988.43MB/s, iops=1976, runt=240195msec
    clat (usec): min=436, max=705828, avg=1001.19, stdev=13539.90
     lat (usec): min=444, max=705836, avg=1009.58, stdev=13539.92
    clat percentiles (usec):
     |  1.00th=[  502],  5.00th=[  516], 10.00th=[  524], 20.00th=[  532],
     | 30.00th=[  540], 40.00th=[  548], 50.00th=[  564], 60.00th=[  580],
     | 70.00th=[  604], 80.00th=[  628], 90.00th=[  652], 95.00th=[  676],
     | 99.00th=[  740], 99.50th=[  788], 99.90th=[115200], 99.95th=[456704],
     | 99.99th=[514048]
    bw (KB  /s): min= 1015, max=951296, per=53.48%, avg=541260.27, stdev=398758.04
    lat (usec) : 500=0.64%, 750=98.51%, 1000=0.66%
    lat (msec) : 2=0.04%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%
    lat (msec) : 100=0.01%, 250=0.02%, 500=0.07%, 750=0.02%
  cpu          : usr=1.30%, sys=23.89%, ctx=2161394, majf=0, minf=10008
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=474823/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=237412MB, aggrb=988.43MB/s, minb=988.43MB/s, maxb=988.43MB/s, mint=240195msec, maxt=240195msec

CPU idleness:
  system: 94.50%
  unit work: mean=53.34us, stddev=2.38