combined/BEEGFS-all-master-node/fio-barenode-write-buffered-block_64k-size_4G-threads_4.log
fio-beegfs-write-buffered-block_64k-size_4G-threads_4: (g=0): rw=rw, bs=64K-64K/64K-64K/64K-64K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 4 processes
fio-beegfs-write-buffered-block_64k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-buffered-block_64k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-buffered-block_64k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
[...]

fio-beegfs-write-buffered-block_64k-size_4G-threads_4: (groupid=0, jobs=4): err= 0: pid=3547793: Fri Nov  9 13:44:43 2018
  write: io=100535MB, bw=428524KB/s, iops=6695, runt=240239msec
    clat (usec): min=4, max=682055, avg=595.62, stdev=15027.21
     lat (usec): min=5, max=682059, avg=596.41, stdev=15027.23
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[    7], 40.00th=[    7], 50.00th=[    8], 60.00th=[   16],
     | 70.00th=[   17], 80.00th=[   18], 90.00th=[  660], 95.00th=[  756],
     | 99.00th=[  852], 99.50th=[  908], 99.90th=[346112], 99.95th=[464896],
     | 99.99th=[505856]
    bw (KB  /s): min=  343, max=626688, per=26.86%, avg=115112.43, stdev=172126.70
    lat (usec) : 10=52.05%, 20=30.43%, 50=4.47%, 100=0.55%, 250=0.01%
    lat (usec) : 500=0.01%, 750=7.33%, 1000=4.89%
    lat (msec) : 2=0.12%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.09%, 750=0.01%
  cpu          : usr=0.35%, sys=6.85%, ctx=1029033, majf=0, minf=30591
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1608566/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=100535MB, aggrb=428524KB/s, minb=428524KB/s, maxb=428524KB/s, mint=240239msec, maxt=240239msec

CPU idleness:
  system: 93.98%
  unit work: mean=52.80us, stddev=5.37